import * as React from "react";
import Svg, { Path, SvgProps } from "react-native-svg";

export function Love(props: SvgProps) {
	return (
		<Svg width={20} height={20} viewBox="0 0 20 20" fill="none" {...props}>
			
                <Path
                    d="M12 21.35l-1.45-1.32C5.4 15.36 2 12.28 2 8.5 2 5.42 4.42 3 7.5 3c1.74 0 3.41.81 4.5 2.09C13.09 3.81 14.76 3 16.5 3 19.58 3 22 5.42 22 8.5c0 3.78-3.4 6.86-8.55 11.54L12 21.35z"
                    fill={props.fill || "none"}
                    // Немного масштабируем внутрянку под твой viewBox
                    transform="scale(0.83) translate(1, 0.5)" 
                />
            
			<Path
				d="M10.084 15.458l-.084.084-.091-.084C5.95 11.867 3.334 9.492 3.334 7.083c0-1.666 1.25-2.916 2.916-2.916 1.284 0 2.534.833 2.975 1.966h1.55C11.217 5 12.467 4.167 13.75 4.167c1.667 0 2.917 1.25 2.917 2.916 0 2.409-2.617 4.784-6.583 8.375zM13.75 2.5c-1.45 0-2.841.675-3.75 1.733A5.011 5.011 0 006.25 2.5c-2.566 0-4.583 2.008-4.583 4.583 0 3.142 2.833 5.717 7.125 9.609l1.208 1.1 1.209-1.1c4.291-3.892 7.125-6.467 7.125-9.609 0-2.575-2.017-4.583-4.584-4.583z"
				fill={props.fill ||"#81818D"}
				fillOpacity={1}
			
			/>
			
		</Svg>
	);
}
